#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

struct s {
	char a : 3;
	char b : 4;
	char c : 5;
	char d : 4;
};
int main() {
	struct s ss = { 0 };
	ss.a = 10;//二进制1010
	ss.b = 12;//      1100
	ss.c = 3;//       0011
	ss.d = 4;//       0100
	// 00000000 00000000 00000000 每个字节从右向左使用
//a存入00000010
//b存入01100010
//c存入01100010 00000011
//d存入01100010 00000011 00000100 转换为16进制
	//0110 0010 0000 0011 0000 0100
	//  6   2    0    3     0    4
	//内存储存三个字节为62 03 04
	return 0;
}